## Series

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [3]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20,'c':30}

In [4]:
pd.Series(data = my_data)           # Series 'S' is capital

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [8]:
pd.Series(arr,labels)    # numpy array

a    10
b    20
c    30
dtype: int32

In [9]:
pd.Series(d)      # dictionary

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [11]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [12]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [13]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [14]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [15]:
ser1 + ser2  #pandas always converted to floats so that no info is lost

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## DataFrames

In [16]:
from numpy.random import randn

In [17]:
np.random.seed(101)        # seed - get the same random numbers

In [18]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])             # D and F capitalized

In [19]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df['W'] # grabing a column

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [21]:
type(df['W'])

pandas.core.series.Series

In [23]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [68]:
df['new'] = df['W'] + df['Z'] # creating new columns

In [47]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [54]:
df.drop('new',axis=1)          # axis 1 for columns, axis 0 for index

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [60]:
df.drop('E',axis=0,inplace = True)   #inplace to permanently drops column/row

In [61]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [62]:
df.shape

(4, 4)

In [63]:
df.loc['A']  # selecting rows

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [69]:
df.iloc[2]  # numerical(or) based index

W     -2.018168
X      0.740122
Y      0.528813
Z     -0.589001
new   -2.607169
Name: C, dtype: float64

In [66]:
df.loc['B','Y']   # selecting subsets of rows and columns

-0.8480769834036315

In [76]:
df.loc[['A','B'],['Y','Z']]   # selecting subsets of rows and columns

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [72]:
bool_df = df > 0     # conditional selection

In [75]:
df[bool_df]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118       NaN       NaN  0.605965  1.257083
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057  1.143752

In [77]:
df['W'] >  0    # boolean condition

A     True
B     True
C    False
D     True
Name: W, dtype: bool

In [80]:
df[df['W']>0]    # row where 'W' was not > 0 is omitted

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
D  0.188695 -0.758872 -0.933237  0.955057  1.143752

In [82]:
df[df['W']<0]    # row where 'W' is < 0 is printed

          W         X         Y         Z       new
C -2.018168  0.740122  0.528813 -0.589001 -2.607169

In [86]:
df[df['W']>0]['X']   # row where 'W' was not > 0 is omitted for column 'X'

A    0.628133
B   -0.319318
D   -0.758872
Name: X, dtype: float64

In [90]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
D  0.188695 -0.758872 -0.933237  0.955057  1.143752

In [97]:
df.reset_index(inplace = True)        # reseting the index

In [99]:
newind = 'CA NY WY OR'.split()      # spliting

In [100]:
df['States'] = newind    # adding a new column with values

In [102]:
df     # new values added

  index         W         X         Y         Z       new States
0     A  2.706850  0.628133  0.907969  0.503826  3.210676     CA
1     B  0.651118 -0.319318 -0.848077  0.605965  1.257083     NY
2     C -2.018168  0.740122  0.528813 -0.589001 -2.607169     WY
3     D  0.188695 -0.758872 -0.933237  0.955057  1.143752     OR

In [106]:
df

  index         W         X         Y         Z       new States
0     A  2.706850  0.628133  0.907969  0.503826  3.210676     CA
1     B  0.651118 -0.319318 -0.848077  0.605965  1.257083     NY
2     C -2.018168  0.740122  0.528813 -0.589001 -2.607169     WY
3     D  0.188695 -0.758872 -0.933237  0.955057  1.143752     OR

In [120]:
df.reset_index(drop = True,inplace = True) # reseting index

In [121]:
df

   level_0 index         W         X         Y         Z       new States
0        0     A  2.706850  0.628133  0.907969  0.503826  3.210676     CA
1        1     B  0.651118 -0.319318 -0.848077  0.605965  1.257083     NY
2        2     C -2.018168  0.740122  0.528813 -0.589001 -2.607169     WY
3        3     D  0.188695 -0.758872 -0.933237  0.955057  1.143752     OR

In [141]:
df

               W         X         Y         Z       new
States
CA      2.706850  0.628133  0.907969  0.503826  3.210676
NY      0.651118 -0.319318 -0.848077  0.605965  1.257083
WY     -2.018168  0.740122  0.528813 -0.589001 -2.607169
OR      0.188695 -0.758872 -0.933237  0.955057  1.143752

In [130]:
df

        level_0 index         W         X         Y         Z       new
States
CA            0     A  2.706850  0.628133  0.907969  0.503826  3.210676
NY            1     B  0.651118 -0.319318 -0.848077  0.605965  1.257083
WY            2     C -2.018168  0.740122  0.528813 -0.589001 -2.607169
OR            3     D  0.188695 -0.758872 -0.933237  0.955057  1.143752

In [133]:
df.drop[axis=1,columns='level_0']

SyntaxError: invalid syntax (<ipython-input-133-59a83972017a>, line 1)

In [139]:
df.drop(columns='level_0', inplace = True) # droping columns permanently

In [151]:
df.set_index('W') # overwrites index

                  X         Y         Z       new
W
 2.706850  0.628133  0.907969  0.503826  3.210676
 0.651118 -0.319318 -0.848077  0.605965  1.257083
-2.018168  0.740122  0.528813 -0.589001 -2.607169
 0.188695 -0.758872 -0.933237  0.955057  1.143752

In [152]:
df

               W         X         Y         Z       new
States
CA      2.706850  0.628133  0.907969  0.503826  3.210676
NY      0.651118 -0.319318 -0.848077  0.605965  1.257083
WY     -2.018168  0.740122  0.528813 -0.589001 -2.607169
OR      0.188695 -0.758872 -0.933237  0.955057  1.143752

In [24]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))    # tuple pairs
hier_index = pd.MultiIndex.from_tuples(hier_index)   # multi-level index

In [25]:
df1 = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [27]:
df1

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [29]:
df1.loc['G1']    # sub data frame in return

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [30]:
df1.loc['G1'].loc[1]    # sub data frame in return

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [33]:
df1.index.names    # indexes don't have names

FrozenList([None, None])

In [36]:
df1.index.names = ['Groups','Num']   # giving indexes names

In [35]:
df1

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [41]:
df1.loc['G2'].loc[2]['B']

0.07295967531703869

In [43]:
df1.xs(1,level='Num')   # cross section result (select level)

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

## Missing Data

#### How to handle null values

In [44]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}  # using dictionries in dataframes

In [45]:
df2 = pd.DataFrame(d)

In [47]:
df2        # keys become columns and values becomes rows

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [48]:
df2.dropna()  # drops rows with null values since index = 0 (default)

     A    B  C
0  1.0  5.0  1

In [50]:
df2.dropna(axis = 1)   # drops columns with null values

   C
0  1
1  2
2  3

In [52]:
df2.dropna(thresh=2) # droping rows with 2 or more null values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [56]:
df2.fillna(value = 'Fill value') # filling null values with a specified value

            A           B  C
0           1           5  1
1           2  Fill value  2
2  Fill value  Fill value  3

In [58]:
df2['A'].fillna(value = df2['A'].mean()) # filling null values with mean of the particular column

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [76]:
l = df2.filter(['A','B']).mode()    # tried something on my own
df2[['A','B']].fillna(value = l.iloc[0]) # filling null values with mean of the particular column

     A    B
0  1.0  5.0
1  2.0  5.0
2  1.0  5.0

## Groupby

In [77]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [78]:
df3 = pd.DataFrame(data)

In [79]:
df3

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [84]:
bycomp = df3.groupby('Company')  # stores the object location

In [85]:
bycomp

In [86]:
bycomp.mean() # mean of the group of companies

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [87]:
bycomp.sum() # sum of the group of companies

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [88]:
bycomp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [90]:
bycomp.sum().loc['FB']  # sum of FB sales

Sales    593
Name: FB, dtype: int64

In [92]:
df3.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [93]:
df3.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [94]:
df3.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

## Merging, Joining & Concatenating

In [2]:
import pandas as pd

In [4]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [5]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [6]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [7]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [8]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [12]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation

Concatenation basically glues together DataFrames. Keep in mind that ****dimensions should match along the axis you are concatenating on****. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [10]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [18]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

_____
## Example DataFrames

In [28]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [29]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [30]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

___

## Merging

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [35]:
pd.merge(left,right,how='inner',on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

Or to show a more complicated example:

In [3]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})

In [4]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [5]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [41]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

In [42]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K0   K1  NaN  NaN
2  A2  B2   K1   K0   C1   D1
3  A2  B2   K1   K0   C2   D2
4  A3  B3   K2   K1  NaN  NaN

## Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

Keys to join on are in the index and not in the column (like merge)

In [46]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [47]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [48]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Operations

In [2]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [4]:
len(df['col2'].unique())            # IMP to find the number of unique values

3

In [1]:
df['col2'].value_counts()

NameError: name 'df' is not defined

In [103]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [104]:
def times(x):
    return x*2

In [107]:
df['col1'].apply(times) # apply own custom function

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [111]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [113]:
df['col2'].apply(lambda x:x*2) # Multiplying each value in the column into 2

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [114]:
df.drop('col1',axis = 1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [115]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [120]:
df.sort_values('col2') #  sorting the table by a particular column

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [118]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

###  Pivot Table

In [124]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [125]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [127]:
df.pivot_table(values = 'D', index = ['A','B'],columns=['C'])  # making a pivot table

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Data I/O

In [2]:
pwd # file location

'C:\\Users\\Nikhil Seth\\Desktop\\Practice Files_Python DS and ML'

In [18]:
pd.read_csv('example') # click tab to auto complete file name

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [19]:
d = pd.read_csv('example') # will need a dataframe to write to a csv file

In [20]:
d.to_csv('My_output', index = False) # index = False good practice

In [21]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [22]:
pd.read_excel('Excel_Sample.xlsx',sheet_name = 'Sheet1', index=False)

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [31]:
d.to_excel('Excel_Sample2.xlsx', sheet_name="sheet1")

ImportError: cannot import name 'Workbook' from 'openpyxl.workbook' (unknown location)

In [32]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

# web scraping of html

In [33]:
df

[                             Bank Name           City  ST   CERT  \
 0                 The First State Bank  Barboursville  WV  14361
 1                   Ericson State Bank        Ericson  NE  18265
 2     City National Bank of New Jersey         Newark  NJ  21111
 3                        Resolute Bank         Maumee  OH  58317
 4                Louisa Community Bank         Louisa  KY  58112
 ..                                 ...            ...  ..    ...
 556                 Superior Bank, FSB       Hinsdale  IL  32646
 557                Malta National Bank          Malta  OH   6629
 558    First Alliance Bank & Trust Co.     Manchester  NH  34264
 559  National State Bank of Metropolis     Metropolis  IL   3815
 560                   Bank of Honolulu       Honolulu  HI  21029

                    Acquiring Institution       Closing Date
 0                         MVB Bank, Inc.      April 3, 2020
 1             Farmers and Merchants Bank  February 14, 2020
 2                        Industrial Bank   November 1, 2019
 3                     Buckeye State Bank   October 25, 2019
 4      Kentucky Farmers Bank Corporation   October 25, 2019
 ..                                   ...                ...
 556                Superior Federal, FSB      July 27, 2001
 557                    North Valley Bank        May 3, 2001
 558  Southern New Hampshire Bank & Trust   February 2, 2001
 559              Banterra Bank of Marion  December 14, 2000
 560                   Bank of the Orient   October 13, 2000

 [561 rows x 6 columns]]

In [34]:
type(df)

list

In [36]:
df[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"